// 1) Automatic checking - no restart required
"UPDATES_AVAILABLE_NO_RESTART_MESSAGE" = "Tietokoneelle on saatavilla ohjelmistopäivityksiä. Haluatko asentaa ne?";
"UPDATES_AVAILABLE_NO_RESTART_INFORMATIVE" = "Voit jatkaa tietokoneen käyttöä asennuksen aikana. Tietokonetta ei tarvitse käynnistää uudelleen asennuksen jälkeen.";
"INSTALL_TITLE" = "Asenna";

// 2) Automatic checking - restart required, already downloaded
"UPDATES_AVAILABLE_INSTALL_MESSAGE" = "Tietokoneen ohjelmistopäivitykset ovat valmiina asennettavaksi. Haluatko asentaa ne nyt?";

"UPDATES_AVAILABLE_INSTALL_AND_RESTART_INFORMATIVE" = "Tietokone on käynnistettävä uudelleen, kun päivitysten asennus on suoritettu.";
"LOG_OUT_AND_INSTALL_AND_RESTART_TITLE" = "Asenna ja käynnistä uudelleen";

"UPDATES_AVAILABLE_INSTALL_AND_LOG_OUT_INFORMATIVE" = "Päivitysten asentamiseksi sinun tulee kirjautua ulos.";
"LOG_OUT_AND_INSTALL_TITLE" = "Kirjaudu ulos ja asenna";

"UPDATES_AVAILABLE_INSTALL_AND_SHUTDOWN_INFORMATIVE" = "Tietokone on sammutettava, kun päivitysten asennus on suoritettu.";
"LOG_OUT_AND_INSTALL_AND_SHUTDOWN_TITLE" = "Asenna ja sammuta";

// 3) Automatic checking - Restart / Log out / Shut Down required, need to download
"UPDATES_AVAILABLE_DOWNLOAD_AND_RESTART_MESSAGE" = "Tietokoneelle on saatavilla ohjelmistopäivityksiä. Haluatko ladata ja asentaa ne?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_RESTART_INFORMATIVE" = "Tietokone on käynnistettävä uudelleen, kun päivitysten asennus on suoritettu.";

"UPDATES_AVAILABLE_DOWNLOAD_AND_LOG_OUT_MESSAGE" = "Tietokoneelle on saatavilla ohjelmistopäivityksiä. Haluatko ladata ja asentaa ne?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_LOG_OUT_INFORMATIVE" = "Sinun on kirjauduttava ulos, kun päivitykset on ladattu.";

"UPDATES_AVAILABLE_DOWNLOAD_AND_SHUTDOWN_MESSAGE" = "Tietokoneelle on saatavilla ohjelmistopäivityksiä. Haluatko ladata ja asentaa ne?";
"UPDATES_AVAILABLE_DOWNLOAD_AND_SHUTDOWN_INFORMATIVE" = "Tietokone on sammutettava, kun päivitysten asennus on suoritettu.";

"CONTINUE_TITLE" = "Jatka";


// common buttons
"NOT_NOW_TITLE" = "Ei nyt";
"SHOW_DETAILS_TITLE" = "Näytä yksityiskohdat";
